import os
import numpy as np

#פונקציה הפותחת מילון שהמפתחות הם החומצות האמיניות והערכים הם רשימה של הקודונים המקודדים אליהן, ופותחת גם מילונים לספירת כלל הקודונים והחומצות האמיניות
def Read_dict():
  global RNA_codon_table
  global codon_dict
  global amino_dict
  file = open("data/codon_AA.txt")
  for line in file:
    line = line.rstrip("\r\n")
    parts = line.split()
    codon, AA = parts[0], parts[1]
    if AA not in RNA_codon_table:
        RNA_codon_table[AA] = [codon]
    else:
        RNA_codon_table[AA].append(codon)
    codon_dict[codon] = 0
  file.close()    

#פונקציה המקבלת קובץ דנ"א והופכת אותו לרצף רנ"א
def DNA_RNA_Cod(DNA):
  delimiter = ""
  line_list = []
  DNA = DNA.upper()
  for ch in DNA:
    if ch == "T":
      line_list.append("U")
    else:
      line_list.append(ch)
  RNA = delimiter.join(line_list)
  return RNA    

#פונקציה המקבלת רצף של גן, סופרת כמה פעמים מופיע כל קודון ומחזירה מילון עם הכמויות של כל קודון
def codon_counter(gene):
    for i in range(0, len(gene),3):  
        codon=gene[i:i+3]
        if codon in ["UAA", "UGA", "UAG"]:
            continue
        else:
            codon_dict[codon]+=1

#פונקציה המחשבת את סכום החומצות האמיניות מכל סוג בעזרת כמות הקודונים ומחזירה מילון של הכמויות של כל אחת מהחומצות האמיניות
def amino_counter():
    for amino in RNA_codon_table:
        sum_amino=0
        for codon in RNA_codon_table[amino]:
            sum_amino += codon_dict[codon]
        amino_dict[amino] = sum_amino

#פונקציה המקבלת מילון של סכום כל אחת מהחומצות האמיניות ומילון של סכום הקודונים מכל סוג, ויוצרת לפיהם פרופיל עם אחוז הקודונים יחסית למופע החומצה האמינית
def create_profile():
    profile_dict=dict()
    for amino in RNA_codon_table:
        for codon in RNA_codon_table[amino]:
            if amino_dict[amino] == 0:
               profile_dict[codon] = 0
            else:
                pre_codon= ((codon_dict[codon]*100)/ amino_dict[amino])
                profile_dict[codon]= pre_codon
    profile_list = list(profile_dict.values())
    return profile_list

#פונקציה המחשבת את המרחק האוקלידי בין שני פרופילים
def calc_dist(known_profile, new_profile):
    dist = np.linalg.norm(known_profile - new_profile)
    return dist

# main program

'''e_coli_profile = np.array([1,2,3,4,5])
gene_profile = np.array([0,1,3,4,2])
stap_aureus_profile = np.array([2,3,4,5,6])

dist_e = calc_dist(e_coli_profile, gene_profile)
dist_stap = calc_dist(stap_aureus_profile, gene_profile)

if dist_e > dist_stap:
    print("e.coli")
elif dist_e < dist_stap:
    print("stap aureus")
else:
    print("both")'''

RNA_codon_table = {}
codon_dict = {}
amino_dict = {}
Read_dict()

#הפרופילים המוכנים
b_subtilis = [69.06143059844754, 30.938569401552456, 20.334087660790853, 12.756074321105288, 23.597546450690807, 10.149178180085755, 10.506491186279181, 22.65662220104812, 65.71290659944759, 34.287093400552415, 44.980601357904945, 55.019398642095055, 19.76074520717378, 15.822124304267161, 23.938041125541126, 11.319186765615337, 5.04213048855906, 24.11777210884354, 0, 0, 0, 100.0, 28.46694867743744, 8.870597828856837, 18.89302278171347, 43.76943071199225, 67.60297318385282, 32.39702681614718, 17.65074211502783, 20.663265306122447, 9.893320964749536, 15.876623376623376, 26.43320964749536, 9.482838589981448, 51.053927604038414, 48.946072395961586, 50.551805968435424, 36.60164074560788, 12.846553285956698, 15.802196284273776, 15.93342081635472, 41.30292147247738, 26.96146142689412, 56.88125758044187, 43.11874241955813, 70.06386411210218, 29.936135887897816, 100.0, 28.120394828305297, 25.909912414847767, 19.56902544140136, 26.40066731544557, 24.423207693802215, 20.81552360598407, 28.308966388187294, 26.452302312026422, 63.99863085265452, 36.00136914734548, 18.02519928002057, 34.15842254131085, 31.45579299238067, 16.36058518628791, 67.98319870759289, 32.01680129240711]
e_coli = [57.41787624140565, 42.58212375859435, 14.575569965670022, 14.85138346879493, 12.181274023649541, 15.44115489568968, 15.180012323582055, 27.770605322613772, 57.034220532319395, 42.965779467680605, 44.505740271358285, 55.494259728641715, 12.982062070929166, 12.830206586731627, 10.265272548957576, 10.464582871966845, 3.6034040937707617, 49.854471827644026, 0, 0, 0, 100.0, 15.73035861460909, 12.259214536254385, 19.034749774787727, 52.9756770743488, 57.284230406043434, 42.715769593956566, 38.438206072611344, 40.42217338822, 6.26296078492061, 9.608777739948621, 3.418552106224272, 1.8493299080751493, 34.8607744718209, 65.1392255281791, 51.10026870315372, 42.03931551407156, 6.860415782774713, 16.39957686660246, 43.66484045660514, 12.889780065364636, 27.04580261142776, 44.86534349826145, 55.13465650173855, 77.08954787389601, 22.910452126103994, 100.0, 25.949200421334865, 21.58982093268218, 15.285358613425261, 37.175620032557696, 15.933240265687381, 26.975983212256477, 21.302117140748514, 35.78865938130763, 62.88199497288001, 37.11800502711999, 34.01397408107734, 40.47064520592169, 10.605082322556841, 14.910298390444126, 69.19476620108031, 30.805233798919684]
stap_aureus = [73.27562979927254, 26.724370200727467, 21.391355397372863, 2.66872141092439, 33.77118955015777, 6.403952936572002, 27.386805606516475, 8.377975098456496, 78.4281066005578, 21.571893399442207, 80.57269809923476, 19.427301900765244, 60.041599260457595, 14.477202944963517, 11.67090362837994, 2.0205355079401763, 9.307009145234243, 2.4827495130245305, 0, 0, 0, 100.0, 33.78409562929801, 2.8014953616098213, 51.07767572806572, 12.336733281026445, 80.41480703596744, 19.585192964032554, 38.264537511298585, 8.91404467782895, 13.894030043472647, 1.2051822838204278, 33.697757500107606, 4.024447983471786, 88.21473608358855, 11.785263916411457, 61.3009671247784, 17.19761992522774, 21.501412949993856, 29.415245298551618, 4.427465205423066, 50.0887551130663, 16.06853438295902, 76.34668508287292, 23.653314917127073, 81.41006507074205, 18.589934929257954, 100.0, 41.5985204661423, 10.662002272777913, 34.015909445397625, 13.723567815682168, 31.997424754546916, 6.72782874617737, 46.80278678347244, 14.47195971580327, 78.7000942699177, 21.299905730082294, 54.28188899707887, 15.136319376825705, 23.483446932814022, 7.098344693281402, 84.23151418480118, 15.768485815198815]

existing_profiles = [b_subtilis, e_coli, stap_aureus]

folder_path = "results"
for file_name in os.listdir(folder_path):
    for codon in codon_dict: codon_dict[codon] = 0
    for amino in amino_dict: amino_dict[amino] = 0
    
    full_path = os.path.join(folder_path, file_name)
    with open (full_path ,"r") as gene_file:
       for line in gene_file:
            if line and line[0] in ["A", "C", "G", "T"]:
                continue
            else:
                gene= DNA_RNA_Cod(line)
                codon_counter(gene)
                amino_counter()
            profile = create_profile()